jMeter/result_html/result_html/statistics.json
{
  "08-Session-Submit-Answer" : {
    "transaction" : "08-Session-Submit-Answer",
    "sampleCount" : 15668,
    "errorCount" : 28,
    "errorPct" : 0.1787082,
    "meanResTime" : 15.409241766658171,
    "medianResTime" : 13.0,
    "minResTime" : 0.0,
    "maxResTime" : 333.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 33.0,
    "throughput" : 4.353478684542567,
    "receivedKBytesPerSec" : 1.9595314713746552,
    "sentKBytesPerSec" : 2.3445731542381263
  },
  "21-Progress-Overview" : {
    "transaction" : "21-Progress-Overview",
    "sampleCount" : 15622,
    "errorCount" : 12,
    "errorPct" : 0.07681475,
    "meanResTime" : 11.457047753168627,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 281.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 26.770000000000437,
    "throughput" : 4.341965196461279,
    "receivedKBytesPerSec" : 2.0014391818792023,
    "sentKBytesPerSec" : 1.894756152703931
  },
  "06-Session-Get-Info" : {
    "transaction" : "06-Session-Get-Info",
    "sampleCount" : 15674,
    "errorCount" : 28,
    "errorPct" : 0.17863978,
    "meanResTime" : 9.56896771723872,
    "medianResTime" : 8.0,
    "minResTime" : 0.0,
    "maxResTime" : 290.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 23.0,
    "throughput" : 4.355448381378777,
    "receivedKBytesPerSec" : 2.634876809015784,
    "sentKBytesPerSec" : 1.9219414170101463
  },
  "03-Vocab-Course-Detail" : {
    "transaction" : "03-Vocab-Course-Detail",
    "sampleCount" : 15696,
    "errorCount" : 16,
    "errorPct" : 0.1019368,
    "meanResTime" : 10.594801223241593,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 312.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 24.0,
    "throughput" : 4.361021205799025,
    "receivedKBytesPerSec" : 21.796209631519268,
    "sentKBytesPerSec" : 1.915358995002163
  },
  "02-Vocab-List-Courses" : {
    "transaction" : "02-Vocab-List-Courses",
    "sampleCount" : 15702,
    "errorCount" : 4,
    "errorPct" : 0.025474463,
    "meanResTime" : 22.489237039867447,
    "medianResTime" : 20.0,
    "minResTime" : 5.0,
    "maxResTime" : 348.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 46.0,
    "throughput" : 4.362564627885907,
    "receivedKBytesPerSec" : 199.00045202880648,
    "sentKBytesPerSec" : 1.9089828845673513
  },
  "16-Exam-Complete" : {
    "transaction" : "16-Exam-Complete",
    "sampleCount" : 15638,
    "errorCount" : 22,
    "errorPct" : 0.14068295,
    "meanResTime" : 30.35349788975561,
    "medianResTime" : 28.0,
    "minResTime" : 0.0,
    "maxResTime" : 368.0,
    "pct1ResTime" : 38.0,
    "pct2ResTime" : 43.0,
    "pct3ResTime" : 60.61000000000058,
    "throughput" : 4.346240688016738,
    "receivedKBytesPerSec" : 2.052750848757883,
    "sentKBytesPerSec" : 2.0418752807074494
  },
  "17-History-All" : {
    "transaction" : "17-History-All",
    "sampleCount" : 15636,
    "errorCount" : 10,
    "errorPct" : 0.06395498,
    "meanResTime" : 21.957917625991257,
    "medianResTime" : 19.0,
    "minResTime" : 1.0,
    "maxResTime" : 349.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 50.0,
    "throughput" : 4.345143809920801,
    "receivedKBytesPerSec" : 25.414977052070306,
    "sentKBytesPerSec" : 1.9303198164165625
  },
  "20-Progress-Upcoming-Review" : {
    "transaction" : "20-Progress-Upcoming-Review",
    "sampleCount" : 15628,
    "errorCount" : 14,
    "errorPct" : 0.0895828,
    "meanResTime" : 11.641028922446859,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 288.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 25.0,
    "throughput" : 4.343195845116767,
    "receivedKBytesPerSec" : 4.145798034271729,
    "sentKBytesPerSec" : 1.9543924269413206
  },
  "22-Progress-Daily" : {
    "transaction" : "22-Progress-Daily",
    "sampleCount" : 15620,
    "errorCount" : 18,
    "errorPct" : 0.11523688,
    "meanResTime" : 14.886811779769529,
    "medianResTime" : 13.0,
    "minResTime" : 0.0,
    "maxResTime" : 297.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 32.0,
    "throughput" : 4.343221252087846,
    "receivedKBytesPerSec" : 2.2175179637521762,
    "sentKBytesPerSec" : 1.9200005955593482
  },
  "09-Session-Complete" : {
    "transaction" : "09-Session-Complete",
    "sampleCount" : 15660,
    "errorCount" : 20,
    "errorPct" : 0.12771392,
    "meanResTime" : 29.316985951468588,
    "medianResTime" : 27.0,
    "minResTime" : 0.0,
    "maxResTime" : 381.0,
    "pct1ResTime" : 38.0,
    "pct2ResTime" : 44.0,
    "pct3ResTime" : 59.0,
    "throughput" : 4.351265493047561,
    "receivedKBytesPerSec" : 2.050895948071564,
    "sentKBytesPerSec" : 2.044221915026398
  },
  "07-Session-Get-Questions" : {
    "transaction" : "07-Session-Get-Questions",
    "sampleCount" : 15672,
    "errorCount" : 16,
    "errorPct" : 0.10209291,
    "meanResTime" : 11.399693721286287,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 281.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 26.0,
    "throughput" : 4.354412259926627,
    "receivedKBytesPerSec" : 25.641799431623056,
    "sentKBytesPerSec" : 1.965463126558025
  },
  "18-History-Practice" : {
    "transaction" : "18-History-Practice",
    "sampleCount" : 15632,
    "errorCount" : 18,
    "errorPct" : 0.11514841,
    "meanResTime" : 15.700230296827035,
    "medianResTime" : 14.0,
    "minResTime" : 0.0,
    "maxResTime" : 336.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 25.0,
    "pct3ResTime" : 36.0,
    "throughput" : 4.345530861136216,
    "receivedKBytesPerSec" : 13.51783138912155,
    "sentKBytesPerSec" : 2.0270207816562555
  },
  "24-Chatbot-Send-Message" : {
    "transaction" : "24-Chatbot-Send-Message",
    "sampleCount" : 15616,
    "errorCount" : 24,
    "errorPct" : 0.15368852,
    "meanResTime" : 22.675076844262183,
    "medianResTime" : 20.0,
    "minResTime" : 0.0,
    "maxResTime" : 398.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 53.0,
    "throughput" : 4.34053884276387,
    "receivedKBytesPerSec" : 1.8303635333309243,
    "sentKBytesPerSec" : 2.023912216034644
  },
  "23-Progress-Recent-Sessions" : {
    "transaction" : "23-Progress-Recent-Sessions",
    "sampleCount" : 15620,
    "errorCount" : 10,
    "errorPct" : 0.064020485,
    "meanResTime" : 9.627016645326588,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 241.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 22.0,
    "throughput" : 4.34209600924683,
    "receivedKBytesPerSec" : 5.572347134313929,
    "sentKBytesPerSec" : 1.9247267460882913
  },
  "13-Session-Create-Exam" : {
    "transaction" : "13-Session-Create-Exam",
    "sampleCount" : 15648,
    "errorCount" : 12,
    "errorPct" : 0.07668712,
    "meanResTime" : 21.8833077709612,
    "medianResTime" : 20.0,
    "minResTime" : 0.0,
    "maxResTime" : 350.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 42.0,
    "throughput" : 4.348199406957619,
    "receivedKBytesPerSec" : 2.2563547183368247,
    "sentKBytesPerSec" : 2.326133547144813
  },
  "19-Progress-Streak" : {
    "transaction" : "19-Progress-Streak",
    "sampleCount" : 15632,
    "errorCount" : 14,
    "errorPct" : 0.089559875,
    "meanResTime" : 9.890736949846511,
    "medianResTime" : 8.0,
    "minResTime" : 0.0,
    "maxResTime" : 310.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 24.0,
    "throughput" : 4.344352161545869,
    "receivedKBytesPerSec" : 6.738776420071229,
    "sentKBytesPerSec" : 1.8870759075282741
  },
  "25-Chatbot-Get-History" : {
    "transaction" : "25-Chatbot-Get-History",
    "sampleCount" : 15610,
    "errorCount" : 8,
    "errorPct" : 0.0512492,
    "meanResTime" : 11.268417680973725,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 305.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 24.889999999999418,
    "throughput" : 4.339532108923646,
    "receivedKBytesPerSec" : 64.222505369337,
    "sentKBytesPerSec" : 1.8518119501220685
  },
  "15-Exam-Submit-Answer" : {
    "transaction" : "15-Exam-Submit-Answer",
    "sampleCount" : 15640,
    "errorCount" : 36,
    "errorPct" : 0.23017903,
    "meanResTime" : 15.220843989769776,
    "medianResTime" : 13.0,
    "minResTime" : 1.0,
    "maxResTime" : 320.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 34.0,
    "throughput" : 4.346738556460354,
    "receivedKBytesPerSec" : 1.9612613471345988,
    "sentKBytesPerSec" : 2.3412492226800254
  },
  "10-Session-Get-Detail" : {
    "transaction" : "10-Session-Get-Detail",
    "sampleCount" : 15656,
    "errorCount" : 22,
    "errorPct" : 0.1405212,
    "meanResTime" : 15.321410321921373,
    "medianResTime" : 14.0,
    "minResTime" : 1.0,
    "maxResTime" : 303.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 32.0,
    "throughput" : 4.350822587816808,
    "receivedKBytesPerSec" : 65.6079383805997,
    "sentKBytesPerSec" : 1.950349243761116
  },
  "14-Exam-Get-Questions" : {
    "transaction" : "14-Exam-Get-Questions",
    "sampleCount" : 15646,
    "errorCount" : 26,
    "errorPct" : 0.16617666,
    "meanResTime" : 11.046018151604244,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 298.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 26.0,
    "throughput" : 4.3476364068838596,
    "receivedKBytesPerSec" : 14.642670774149375,
    "sentKBytesPerSec" : 1.9614134981592153
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 360006,
    "errorCount" : 380,
    "errorPct" : 0.1055538,
    "meanResTime" : 27.36509391510122,
    "medianResTime" : 16.0,
    "minResTime" : 0.0,
    "maxResTime" : 849.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 148.95000000000073,
    "pct3ResTime" : 291.9900000000016,
    "throughput" : 100.00913957181801,
    "receivedKBytesPerSec" : 509.143154985053,
    "sentKBytesPerSec" : 45.252406425473175
  },
  "04-Vocab-Topic-Detail" : {
    "transaction" : "04-Vocab-Topic-Detail",
    "sampleCount" : 15694,
    "errorCount" : 8,
    "errorPct" : 0.050974894,
    "meanResTime" : 10.77188734548233,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 352.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 26.0,
    "throughput" : 4.36036738887509,
    "receivedKBytesPerSec" : 36.51567348682555,
    "sentKBytesPerSec" : 1.9117902959598672
  },
  "01-Auth-Login" : {
    "transaction" : "01-Auth-Login",
    "sampleCount" : 15708,
    "errorCount" : 4,
    "errorPct" : 0.025464732,
    "meanResTime" : 276.22396231219744,
    "medianResTime" : 270.0,
    "minResTime" : 1.0,
    "maxResTime" : 849.0,
    "pct1ResTime" : 298.0,
    "pct2ResTime" : 311.0,
    "pct3ResTime" : 358.0,
    "throughput" : 4.363907914542081,
    "receivedKBytesPerSec" : 5.371949711225867,
    "sentKBytesPerSec" : 1.1282757264428707
  },
  "05-Session-Create-Practice" : {
    "transaction" : "05-Session-Create-Practice",
    "sampleCount" : 15688,
    "errorCount" : 10,
    "errorPct" : 0.06374299,
    "meanResTime" : 19.759688934217273,
    "medianResTime" : 18.0,
    "minResTime" : 1.0,
    "maxResTime" : 313.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 38.0,
    "throughput" : 4.358814206933649,
    "receivedKBytesPerSec" : 2.1373544610537953,
    "sentKBytesPerSec" : 2.093829571871812
  }
}